# Pandas Datatypes: Dataframes contd

### MultiIndex and Hierarchy in dataframes

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Creating multi-index levels
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_id = list(zip(outside, inside))
hier_id = pd.MultiIndex.from_tuples(hier_id)

In [3]:
# Creating a dataframe with multilevel index
dataframe = pd.DataFrame(np.random.randn(6,2), hier_id, ['A', 'B'])
dataframe

             A         B
G1 1  1.238283  1.105461
   2 -0.286287  0.362974
   3 -0.297424  0.621779
G2 1  1.271626 -0.823247
   2  0.598074  0.504210
   3 -0.369220 -0.639285

In [4]:
dataframe.loc['G1']

          A         B
1  1.238283  1.105461
2 -0.286287  0.362974
3 -0.297424  0.621779

In [5]:
dataframe.index.names = ['Groups','S/No']

In [6]:
# Fetching a particular value
dataframe.loc['G2'].loc[2, 'B']

0.5042097245733159

In [7]:
# Grabbing crossections of MLI dfs using .xs()
dataframe.xs('G1')

             A         B
S/No
1     1.238283  1.105461
2    -0.286287  0.362974
3    -0.297424  0.621779

In [8]:
# Grabbing all '1' rows accross both groups
dataframe.xs(1, level='S/No')

               A         B
Groups
G1      1.238283  1.105461
G2      1.271626 -0.823247

### Dealing with missing data

In [9]:
# NaN or Null is often used to represent missing values
d = {
    'a': [1,2,np.nan,3],
    'b': [5, np.nan, np.nan,6],
    'c': [1,2,3,4],
}
df = pd.DataFrame(d)
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3
3  3.0  6.0  4

In [10]:
# Drop all rows with missing values
df.dropna()

     a    b  c
0  1.0  5.0  1
3  3.0  6.0  4

In [11]:
# Drop all columns with missing values
df.dropna(axis=1)

   c
0  1
1  2
2  3
3  4

In [12]:
# drop rows with <2 non NaN values
df.dropna(thresh=2)

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
3  3.0  6.0  4

In [13]:
# Filling up NaN data
df.fillna(value='FILL')

      a     b  c
0   1.0   5.0  1
1   2.0  FILL  2
2  FILL  FILL  3
3   3.0   6.0  4

In [14]:
# filling all missing vals with the mean value of that column permanently
cols = df.columns.to_list()
for col in cols:
    df[col].fillna(value=df[col].mean(), inplace=True)
df

     a    b  c
0  1.0  5.0  1
1  2.0  5.5  2
2  2.0  5.5  3
3  3.0  6.0  4

### Grouping in Pandas

In [15]:
data = {
    'company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'sales': [200,120,340,124,243,350]
}

In [16]:
comp = pd.DataFrame(data)
comp

  company   person  sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [17]:
# Returns a pandas groupby object
bycomp = comp.groupby('company')
bycomp

In [18]:
# getting max sales by company
bycomp.mean(numeric_only=True)

         sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

In [20]:
bycomp.min()

          person  sales
company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

### Operations on Dataframes

In [26]:
df_opps = pd.DataFrame({
    'col1': [1,2,3,4],
    'col2': [444,555,666,444],
    'col3': ['abc', 'def', 'ghi', 'xyz']
})
df_opps.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [30]:
# Unique values in a column
df_opps['col2'].unique()

array([444, 555, 666], dtype=int64)

In [31]:
# Number of unique values
df_opps['col2'].nunique()

3

In [32]:
# How many times each unique value occured
df_opps['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [33]:
# Using the apply method to call custom functions on our dataframes
def times2(x):
    return x*2
df_opps['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [34]:
# Apply can also be used with built in python functions
# This gets the length of every string in col3
df_opps['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [37]:
# Apply with lambda functions
df_opps['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [39]:
# Remove row 0
df_opps.drop(0)

   col1  col2 col3
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [40]:
# Remove col1
df_opps.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [43]:
# Sorting in ascending order by a column or alphabetical order
df_opps.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [46]:
# finding null values. This can also be passed into the a df conditionally like df[df.isnull()]
df_opps.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [47]:
test_df = pd.DataFrame({
    'a': ['foo','foo','foo','bar','bar','bar',],
    'b': ['one','one','two','two','one','one',],
    'c':['x','y','x','y','x','y',],
    'd':[1,3,2,5,4,1]
})
test_df

     a    b  c  d
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [59]:
# This is used to restructure the dataframe based on certain columns
# essentially, it means that column d now provides the data for the df, columns a & b, the indexes or row labels, and column c provides the column labels. Lists can also be used at any point and using them in the index arg returns a multi level index df and using a list in the columns provides a multilevel column df.
test_df.pivot_table(values='d', index=['a'], columns=['c','b'])

c      x         y
b    one  two  one  two
a
bar  4.0  NaN  1.0  5.0
foo  1.0  2.0  3.0  NaN